



# Данный класс необходим для совмещения лаунчера и игры 
# Основной класс 
class Main:
    def launcher(self) -> None:
        '''Необходима для запуска и получения инфы из лаунчера'''
        # Количество обновлений экрана
        FPS = 30
        # Размер окна игры
        size = width, height = 1_600, 900
        # Маштабирование блоков(Размер блока)
        block_scaling = 100
        
        
    def load_image(self, block_scaling:int=100) -> None:
        ...
    
    
    ...
    
    



# Основная функция для работы с программой
def main():
    ...
    
    
if __name__ == "__main__":
    main()